Repository: porrey/Virtual-ZPL-Printer
Catalog: Src/Virtual Printer Solution/VirtualPrinter/Properties/Strings.*.resx
Languages: uk

# About_Title
source: About
uk: про

# About_Version
source: Version
uk: Версія

source: Cancel
uk: Скасувати

source: Close
uk: Закрити

# Close_Tooltip
source: Close the window.
uk: Закрити вікно.

# Configuration_Button_Browse_Tooltip
source: Browse for a folder to specify where label images are cached.
uk: Перегляньте папку, щоб указати, де кешуються зображення міток.

# Configuration_Button_Filters_Tooltip
source: Click to edit ZPL filters.
uk: Натисніть, щоб редагувати фільтри ZPL.

# Configuration_View_Button_Add_Text
source: Add
uk: додати

# Configuration_View_Button_Add_Tooltip
source: Add a new printer configuration.
uk: Додайте нову конфігурацію принтера.

# Configuration_View_Button_Clone_Text
source: Clone
uk: Клон

# Configuration_View_Button_Clone_Tooltip
source: Clone the selected printer configuration.
uk: Скопіюйте вибрану конфігурацію принтера.

# Configuration_View_Button_Configure_Text
source: Configure
uk: Налаштувати

# Configuration_View_Button_Configure_Tooltip
source: Click to edit the physical printer.
uk: Натисніть, щоб редагувати фізичний принтер.

# Configuration_View_Button_Delete_Text
source: Delete
uk: Видалити

# Configuration_View_Button_Delete_Tooltip
source: Delete the selected printer configuration.
uk: Видалити вибрану конфігурацію принтера.

# Configuration_View_Button_Save_Text
source: Save
uk: зберегти

# Configuration_View_Button_Save_Tooltip
source: Save changes to the current printer configuration.
uk: Збережіть зміни в поточній конфігурації принтера.

# Configuration_View_Button_Undo_Text
source: Undo
uk: Скасувати

# Configuration_View_Button_Undo_Tooltip
source: Undo the current changes.
uk: Скасувати поточні зміни.

# Configuration_View_Label_HostAddress
source: Host Address
uk: Адреса хоста

# Configuration_View_Label_LabelCache
source: Label Cache
uk: Кеш міток

# Configuration_View_Label_LabelHeight
source: Label Height
uk: Висота етикетки

# Configuration_View_Label_LabelUnits
source: Label Units
uk: Одиниці етикетки

# Configuration_View_Label_LabelWidth
source: Label Width
uk: Ширина етикетки

# Configuration_View_Label_Name
source: Name
uk: Ім'я

# Configuration_View_Label_PhysicalPrinter
source: Physical Printer
uk: Фізичний принтер

# Configuration_View_Label_TcpPort
source: TCP Port
uk: Порт TCP

# Configuration_View_Title
source: Edit Printer Configuration
uk: Редагувати конфігурацію принтера

# Configure_Printer_Button_Save_Tooltip
source: Save changes to the current printer.
uk: Збережіть зміни поточного принтера.

# Configure_Printer_Title
source: Configure Printer
uk: Налаштувати принтер

# Connectivity_Test_Label_Text
source: TEST
uk: ТЕСТ

# Connectivity_Test_Message_Dns
source: {0}Getting IP address for host name '{1}
uk: {0}Отримання IP-адреси для імені хоста '{1}

# Connectivity_Test_Message_Dns_Failed
source: {0}DNS lookup failed [FAILED]
uk: {0}Помилка пошуку DNS [НЕВІД]

# Connectivity_Test_Message_Failed
source: {0}Test completed with one or more failures
uk: {0}Тестування завершено з однією чи кількома помилками

# Connectivity_Test_Message_Host
source: {0}Found {1} address for host name [OK]
uk: {0}Знайдено {1} адресу для імені хоста [OK]

# Connectivity_Test_Message_Ip
source: {0}IP address '{1}' was found for host name '{2}' [OK]
uk: {0}ІР-адресу "{1}" знайдено для імені хоста "{2}" [OK]

# Connectivity_Test_Message_PortTest
source: {0}Checking port '{1}' connectivity for IP address for host name '{2}'
uk: {0}Перевірка підключення порту "{1}" для IP-адреси для імені хоста "{2}"

# Connectivity_Test_Message_PortTest_Failed
source: {0}Connection to port '{1}' was unsuccessful [FAILED]
uk: {0}Підключення до порту '{1}' не вдалось [ПОМИЛКА]

# Connectivity_Test_Message_PortTest_Success
source: {0}Connection to port '{1}' was successful [OK]
uk: {0}Підключення до порту '{1}' було успішним [OK]

# Connectivity_Test_Message_Start
source: Testing connectivity to '{0}'
uk: Тестування підключення до "{0}"

# Connectivity_Test_Message_Success
source: {0}Test completed successfully
uk: {0}Тест успішно завершено

# Connectivity_Test_Message_WebMethod_Failed
source: {0}{1}/{2} API method connection was unsuccessful [FAILED]
uk: {0}{1}/{2} Підключення методу API не вдалось [ПОМИЛКА]

# Connectivity_Test_Message_WebMethodTest
source: {0}Checking {1}/{2} API method connection
uk: {0}Перевірка підключення методу API {1}/{2}

# Connectivity_Test_Message_WebMethodTest_Success
source: {0}{1}/{2} API method connection was successful [OK]
uk: {0}{1}/{2} Підключення методу API було успішним [OK]

# Connectivity_Test_Title
source: Test Labelary Connection
uk: Тест Labelary Connection

# Connectivity_TestButton_Start_Tooltip
source: Start the connection test.
uk: Почніть перевірку підключення.

# Edit_Filters_Button_Add_Tooltip
source: Add a new filter before this one.
uk: Додайте новий фільтр перед цим.

# Edit_Filters_Button_Cancel_Tooltip
source: Cancel the changes and close the dialog.
uk: Скасуйте зміни та закрийте діалогове вікно.

# Edit_Filters_Button_Delete_Tooltip
source: Delete the this filter.
uk: Видаліть цей фільтр.

# Edit_Filters_Button_Down_Tooltip
source: Move this filter down.
uk: Перемістіть цей фільтр вниз.

# Edit_Filters_Button_Ok_Tooltip
source: Save the changes and close the dialog.
uk: Збережіть зміни та закрийте діалогове вікно.

# Edit_Filters_Button_Up_Tooltip
source: Move this filter up.
uk: Перемістіть цей фільтр вгору.

# Edit_Filters_CheckBox_RegEx_Text
source: Treat Find as Regular Expression.
uk: Розглядати Знайти як регулярний вираз.

# Edit_Filters_Label
source: The filters are processed in the order they appear, from top to bottom.
uk: Фільтри обробляються в тому порядку, в якому вони з’являються, зверху вниз.

# Edit_Filters_Label_Find
source: Find
uk: знайти

# Edit_Filters_Label_Replace
source: Replace
uk: Замінити

# Edit_Filters_Title
source: Edit Filters
uk: Редагувати фільтри

# Edit_Printer_Button_Cancel_Tooltip
source: Cancel the changes and close the dialog.
uk: Скасуйте зміни та закрийте діалогове вікно.

# Edit_Printer_Checkbox_Text
source: Enable Send to Printer
uk: Увімкнути відправити на принтер

# Edit_Printer_Group_Text_Horizontal
source: Horizontal Alignment
uk: Горизонтальне вирівнювання

# Edit_Printer_Group_Text_Vertical
source: Vertical Alignment
uk: Вертикальне вирівнювання

# Edit_Printer_Label
source: When enabled, the image retrieved for the label is sent to this printer.
uk: Якщо ввімкнено, зображення, отримане для мітки, надсилається на цей принтер.

# Edit_Printer_Label_BottomMargin
source: Bottom Margin
uk: Нижня маржа

# Edit_Printer_Label_LeftMargin
source: Left Margin
uk: Ліва маржа

# Edit_Printer_Label_RightMargin
source: Right Margin
uk: Правий запас

# Edit_Printer_Label_SelectPrinter
source: Select Printer
uk: Виберіть принтер

# Edit_Printer_Label_TopMargin
source: Top Margin
uk: Верхній запас

# Edit_Printer_RadioButton_Bottom
source: Bottom
uk: Дно

# Edit_Printer_RadioButton_Center
source: Center
uk: Центр

# Edit_Printer_RadioButton_Left
source: Left
uk: Лівий

# Edit_Printer_RadioButton_Middle
source: Middle
uk: Середина

# Edit_Printer_RadioButton_Right
source: Right
uk: Право

# Edit_Printer_RadioButton_Top
source: Top
uk: Топ

source: Error
uk: Помилка

# Filters_None
source: No Filters
uk: Без фільтрів

# Font_Manager_Button_Add_Text
source: Add
uk: додати

# Font_Manager_Button_Add_Tooltip
source: Add a new custom font.
uk: Додайте новий спеціальний шрифт.

# Font_Manager_Button_Browse_Tooltip
source: Browse for a local TrueType font source file.
uk: Перегляньте локальний вихідний файл шрифту Truetype.

# Font_Manager_Button_Cancel_Tooltip
source: Cancel the current changes and/or close the Font Manager.
uk: Скасувати поточні зміни та/або закрити менеджер шрифтів.

# Font_Manager_Button_Delete_Tooltip
source: Delete this font from the Font Manager.
uk: Видаліть цей шрифт від менеджера шрифтів.

# Font_Manager_Button_Ok_Text
source: Ok
uk: В порядку

# Font_Manager_Button_Ok_Tooltip
source: Save the changes and close the Font Manager.
uk: Збережіть зміни та закрийте менеджера шрифтів.

# Font_Manager_Button_Save_Tooltip
source: Save the current changes to this font.
uk: Збережіть поточні зміни цього шрифту.

# Font_Manager_Button_Update_Tooltip
source: Update the font using Labelary API.
uk: Оновіть шрифт за допомогою API мітки.

# Font_Manager_Label
source: Load custom TrueType fonts to be used in labels. Virtual ZPL Printer will automatically upload the fonts with the each label request to simulate fonts already loaded in the printer.
uk: Завантажте власні шрифти Truetype, які будуть використовуватися в мітках. Віртуальний принтер ZPL автоматично завантажить шрифти з кожним запитом мітки для імітації шрифтів, які вже завантажені в принтер.

# Font_Manager_Label_ByteCount
source: Byte Count
uk: Кількість байтів

# Font_Manager_Label_CharacterDescription
source: If provided, the font will be subset to contain only the specified characters.
uk: Якщо надано, шрифт буде підмножиною, щоб містити лише вказані символи.

# Font_Manager_Label_Characters
source: Characters
uk: Персонажі

# Font_Manager_Label_FontSource
source: Font Source
uk: Джерело шрифту

# Font_Manager_Label_PrinterPath
source: Printer Path
uk: Шлях принтера

# Font_Manager_Title
source: Font Manager
uk: Менеджер шрифтів

# Font_Source_Found
source: Found
uk: знайдено

# Font_Source_Missing
source: Missing
uk: Відсутня

# Font_ViewModel_Dialog_Delete_Text
source: Are you sure you want to delete the selected font?
uk: Ви впевнені, що хочете видалити вибраний шрифт?

# Font_ViewModel_Dialog_Delete_Title
source: Delete Font
uk: Видалити шрифт

# Font_ViewModel_Dialog_Filter
source: TrueType Font|*.ttf|All Files|*.*
uk: Truetype font |*.ttf | всі файли |*.*

# Font_ViewModel_Dialog_Title
source: Select TrueType Font File
uk: Виберіть файл шрифту Truetype

# FontConversion_Error
source: The font does not support sub-setting characters.
uk: Шрифт не підтримує символи піднабору.

# Global_Settings_Button_Cancel_Toolip
source: Cancel the changes and close the dialog.
uk: Скасуйте зміни та закрийте діалогове вікно.

# Global_Settings_Button_Ok_Toolip
source: Save the changes and close the dialog.
uk: Збережіть зміни та закрийте діалогове вікно.

# Global_Settings_Checkbox_EnableLinting_Text
source: Enable Linting
uk: Увімкнути вал

# Global_Settings_Group_Header_Labelary
source: Labelary
uk: Етикетка

# Global_Settings_Group_Header_TCP
source: TCP Settings
uk: Налаштування TCP

# Global_Settings_Label_ApiUrl
source: API URL
uk: URL -адреса API

# Global_Settings_Label_Linger
source: Linger
uk: Затримати

# Global_Settings_Label_LingerTime
source: Linger Time (seconds)
uk: Час затримки (секунди)

# Global_Settings_Label_Method
source: Method
uk: Метод

# Global_Settings_Label_NoDelay
source: No Delay
uk: Немає затримки

# Global_Settings_Label_ReceiveBufferSize
source: Receive Buffer Size (bytes)
uk: Отримати розмір буфера (байти)

# Global_Settings_Label_ReceivedDataEncoding
source: Received Data Encoding
uk: Отримані кодування даних

# Global_Settings_Label_ReceiveTimeout
source: Receive Timeout (ms)
uk: Отримати тайм -аут (MS)

# Global_Settings_Label_SendBufferSize
source: Send Buffer Size (bytes)
uk: Надіслати розмір буфера (байти)

# Global_Settings_Label_SendTimeout
source: Send Timeout (ms)
uk: Надіслати тайм -аут (MS)

# Global_Settings_Label_Tcp
source: These settings are applied to the incoming request from an external application.
uk: Ці налаштування застосовуються до вхідного запиту із зовнішньої програми.

# Global_Settings_Title
source: Global Settings
uk: Глобальні налаштування

# Global_Settings_WebMethod_Get
source: GET
uk: Отримати

# Global_Settings_WebMethod_Post
source: POST
uk: Допис

# HostAddress_Any
source: Any
uk: Будь-який

# HostAddress_Loopback
source: Loopback
uk: Петля

# HostAddress_Unknown
source: Unknown
uk: Невідомий

# Main_Button_Delete_Text
source: Delete
uk: Видалити

# Main_Button_Delete_Tooltip
source: Delete the selected label.
uk: Видалити вибрану мітку.

# Main_Button_Edit_Text
source: Edit
uk: Редагувати

# Main_Button_Edit_Toolip
source: Edit printer configurations.
uk: Редагувати конфігурації принтера.

# Main_Button_Start_Text
source: Start
uk: Почніть

# Main_Button_Start_Tooltip
source: Start the virtual printer.
uk: Запустіть віртуальний принтер.

# Main_Button_Stop_Text
source: Stop
uk: СТІЙ

# Main_Button_Stop_Tooltip
source: Stop the virtual printer from accepting label request.
uk: Зупиніть віртуальний принтер приймати запит на етикетку.

# Main_Button_Test_Text
source: Test
uk: Тест

# Main_Button_Test_Tooltip
source: Send a test label.
uk: Надішліть пробну етикетку.

# Main_Button_View_Text
source: View
uk: Переглянути

# Main_Button_View_Tooltip
source: View the label image in an external viewer.
uk: Перегляньте зображення мітки у зовнішньому засобі перегляду.

# Main_ButtonClear_Text
source: Clear
uk: ясно

# Main_ButtonClear_Tooltip
source: Clear all labels.
uk: Очистити всі мітки.

# Main_Checkbox_AutoStart
source: Auto-Start
uk: Авто старт

# Main_Menu_Connection
source: _Connection
uk: Підключення

# Main_Menu_Connection_Test_Labelary
source: Test Labelary
uk: Тест Labelary

# Main_Menu_Options
source: _Options
uk: Опції

# Main_Menu_Options_About
source: About
uk: про

# Main_Menu_Options_Global_Settings
source: Global Settings
uk: Глобальні налаштування

# Main_Menu_Printer
source: _Printer
uk: Принтер

# Main_Menu_Printer_Clear
source: Clear
uk: ясно

# Main_Menu_Printer_Delete
source: Delete
uk: Видалити

# Main_Menu_Printer_Edit
source: Edit
uk: Редагувати

# Main_Menu_Printer_FontManager
source: Font Manager
uk: Менеджер шрифтів

# Main_Menu_Printer_Start
source: Start
uk: Почніть

# Main_Menu_Printer_Stop
source: Stop
uk: СТІЙ

# Main_Menu_Printer_Test
source: Test
uk: Тест

# Main_Menu_Printer_View
source: View
uk: Переглянути

# Main_Status_Idle
source: Idle
uk: Бездіяльність

# Main_Status_Label
source: label
uk: етикетка

# Main_Status_Labels
source: labels
uk: етикетки

# Main_Status_Listening
source: Listening
uk: Слухання

# Main_Status_LoadingLabels
source: Loading cached labels...
uk: Завантаження кешованих міток...

# Main_Status_Of
source: of
uk: з

# Main_Status_Ready
source: Ready
uk: Готовий

# Main_Status_ViewingLabel
source: Viewing label
uk: Перегляд мітки

# Main_TextBlock_NoCachedLabels
source: no cached labels
uk: немає кешованих міток

# Main_TextBlock_SelectConfiguration
source: Active Printer Configuration
uk: Активна конфігурація принтера

# Main_Title
source: Virtual ZPL Printer
uk: Віртуальний принтер ZPL

# MessageBox_DeletePrinterConfiguration_Message
source: Are you sure you want to delete printer configuration '{0}'?
uk: Ви впевнені, що бажаєте видалити конфігурацію принтера "{0}"?

# MessageBox_DeletePrinterConfiguration_Title
source: Delete Printer Configuration
uk: Видалити конфігурацію принтера

# MessageBox_DeletePrinterConfigurationFailed_Message
source: Delete failed.
uk: Не вдалося видалити.

# MessageBox_DeletePrinterConfigurationFailed_Title
source: Delete Printer Configuration
uk: Видалити конфігурацію принтера

# MessageBox_Exception_Title
source: Unknown Exception
uk: Невідомий виняток

# MessageBox_FontConversion_Exception_Title
source: Error Converting Font
uk: Помилка перетворення шрифту

# New_Printer_Configuration_Name
source: New Printer Configuration
uk: Нова конфігурація принтера

source: Ok
uk: В порядку

# Printer_Configuration_Disabled
source: Disabled
uk: Вимкнено

# Printer_Configuration_Enabled
source: Enabled
uk: Увімкнено

# Printer_Configuration_Host
source: Host
uk: Хост

# Printer_Configuration_Printing
source: Printing
uk: Друк

# Printer_Configuration_Resolution
source: Resolution
uk: роздільна здатність

# Printer_Configuration_Rotation
source: Rotation
uk: Обертання

# Printer_Configuration_Size
source: Size
uk: Розмір

# PrinterConfigurationViewModel_By
source: by
uk: за

# Send_Test_Label_Button_Text
source: Send
uk: Надіслати

# Send_Test_Label_Button_Tooltip
source: Send the selected test label to the virtual printer.
uk: Надішліть вибрану тестову етикетку на віртуальний принтер.

# Send_Test_Label_Select
source: Select Test Label
uk: Виберіть Test Label

# Send_Test_Label_Title
source: Send Test Label
uk: Надіслати тестову етикетку

source: Start
uk: Почніть

# ZPL_Viewer_Title
source: ZPL Viewer
uk: Переглядач ZPL

source: ZPL Warnings
uk: Попередження ZPL
